#### PointCloudEngineRegistry Members

---

|  |
| --- |
| PointCloudEngineRegistry Class   Methods   See Also |

The  PointCloudEngineRegistry  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetSupportedEngines | Returns a list of the identifiers supported by point cloud engines registered to Revit. |
| Public method Static member | IsEngineFileBased | Identifies if a given engine is file-based. |
| Public method Static member | RegisterPointCloudEngine | Registers a new point cloud engine and associates it to a particular file extension. |
| Public method Static member | UnregisterPointCloudEngine | Unregisters the point cloud engine associated to a particular identifier. |

# See Also

PointCloudEngineRegistry Class

Autodesk.Revit.DB.PointClouds Namespace